
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.settings_all["kong-openssl"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"b130bfefe3acdb54c47f05a13dec5e46b0c8cb7a0021b118afc42a43f9bd024c\"" -> "W/\"2d5d16de90d5f4f0174f76619b1baedca032b2ab50c9ca4dad3dc0b164fa3dff\""
        id                          = "kong-openssl"
        name                        = "kong-openssl"
      + primary_language            = "Shell"
        # (31 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["template-template"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"fd3d7d0bfffcde2e080c2a8a5c6d3f2c13f576d1234f24cac4ba5457fbcca973\"" -> "W/\"b8e57be002934844f78aa9c51f79eca06b94e3c837bdf6ee237e4c6eeb4ac3c0\""
        id                          = "template-template"
        name                        = "template-template"
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ enforcement = "active" -> "disabled"
      ~ etag        = "W/\"ea9f1ba1cba5145f65f036b4e1248fd36aa13a9092a3331270829d487178dc5e\"" -> "W/\"1d7ef0a7e07c6d355a3636b7eb1b5b92414eeefcf61c706a64765ba3488b6c84\""
        id          = "1252074"
        name        = "protect-main-branch-kong-build-images"
        # (4 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ enforcement = "active" -> "disabled"
      ~ etag        = "W/\"57a7b791e49e60c6f8c816bf9e7b928dcff429f2d69181caddbf946c7ac670f2\"" -> "W/\"48ef3c202c62e9d5b21b4d96d99f14a2fe25b23d1b10f6a727f99a5d096c04fe\""
        id          = "1252075"
        name        = "protect-main-branch-template-1-github-release"
        # (4 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"a455d6f59b4c09e700aebba20740fc416c120dc2294c5b79219a7babe43a5da1\"" -> "W/\"c821a93610f50168c21b5a7cf0ceff3289ec30984fb680339cf3e799978a43e1\""
        id          = "1252077"
        name        = "protect-main-branch-template-1-terraform"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"dbb556ac5e59f8dd8c207f4537395ede71c6f4adb8cbf41f0a2ffe6aa4a99de0\"" -> "W/\"0ca09eb09bff105de843d57324bb012c81caa6fe5fb947c445186a5fbf6d6ed4\""
        id          = "1252076"
        name        = "protect-main-branch-template-template"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["terraform-github"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"d0c5816a924fa1fb86c45a2ac880045f0b5e439e2df2efe2a60d01c5f3c39dd5\"" -> "W/\"afa6986691da9babb9a8bdf66f6294a8f7f14be937d7d64615b65f549dcdb4e0\""
        id          = "1252078"
        name        = "protect-main-branch-terraform-github"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"4de55b9be87b1a9ee47ad76f983bd71e285b1e67a6d0f660c0c2b4ad786d8257\"" -> "W/\"a5c8f04a3a209ad8adb1cf000e5c6bb4ea5e0389f8785de2801a25fd7954a2b6\""
        id          = "1252079"
        name        = "protect-main-branch-terraform-template-1-terraform"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["terraform-github"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"f43694ec619112f36115507396b52fe6fdf3aee85ae216b9d162d5bf42e8b05c\"" -> "W/\"1d4d379d536b7642a47553bb695eaed6b527e23f177eaa3a367664bbbf9070fe\""
        id          = "1252080"
        name        = "protect-main-branch-terraform-terraform-github"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.settings_all["kong-openssl"] will be updated in-place
  ~ resource "github_repository" "settings_all" {
        id                          = "kong-openssl"
        name                        = "kong-openssl"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-runtime"] will be created
  + resource "github_repository" "settings_all" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "kong-runtime"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "gh-org-template"
          + repository           = "template-1-github-release"
        }
    }

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ enforcement = "disabled" -> "active"
        id          = "1252074"
        name        = "protect-main-branch-kong-build-images"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-openssl"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_all" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "protect-main-branch-kong-openssl"
      + node_id     = (known after apply)
      + repository  = "kong-openssl"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "pre-commit"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ enforcement = "disabled" -> "active"
        id          = "1252075"
        name        = "protect-main-branch-template-1-github-release"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 3 to change, 0 to destroy.

<!-- Sticky Pull Request Commentterraform-plan -->